tutorials/cfdemSolverRhoPimpleChem/ISO4695/CFD/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.003;

boundaryField
{
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    side-walls
    {
        type            zeroGradient;
    }
    inlet
    {
        type            zeroGradient;
        // If turbulence is present
        /*         
         * type            compressible::turbulentMixingLengthDissipationRateInlet;
         * mixingLength    0.005;
         * value           uniform 200;
        */
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
