tutorials/cfdemSolverRhoPimpleChem/ISO4695/CFD/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
limitedTemperature
{
    type        limitTemperature;
    active      yes;
    limitTemperatureCoeffs
    {
        active          yes;
        selectionMode   all;
        Tmin     1200;
        Tmax     2500;
    }
} 


